stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static int32_t radio_stm32wlxx_do_handshake(void)
{
    uint32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;
    stm32wlxx_rcp_irq_status_t irq_status;

    do
    {
        /* Perform GPIO handshake request */
        hal_err = stm32wlxx_hal_gpio_handshake_request(&drv_ctx);

        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("STM32WLxx GPIO handshaking failed. HAL error %d", (int32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        STM32WLxx_LOG_INFO("Successful GPIO handshake with STM32WLxx, proceeding with SPI handshake...");

        /* If we got here the IRQ pin is actively driven low by an external source - we can send a handshake message via SPI now */
        hal_err = stm32wlxx_hal_retrieve_radio_irq(&drv_ctx,  &irq_status, NULL, 0u);

        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("Unable to retrieve STM32WLxx IRQ status. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
        }
        else
        {
            err = RADIO_ERROR_NONE;
            STM32WLxx_LOG_DEBUG("Retrieved STM32WLxx IRQ status. IRQ flags: 0x%x, followup data size: %u", irq_status.irq_flags, irq_status.followup_payload_len);
        }

        /* Send out IRQ acknowledgment to clear the IRQ indication by the STM32WLxx side - this is a mandatory step regardless of the valid or invalid IRQ indication */
        hal_err = stm32wlxx_hal_acknowledge_radio_irq(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("Unable to acknowledge STM32WLxx IRQ status. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        hal_err = stm32wlxx_hal_wait_radio_irq_released(&drv_ctx, STM32WLxx_HAL_RADIO_IRQ_RELEASE_WAIT_TIME_US);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("STM32WLxx failed to release the IRQ line after successful ACK. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Check that we have received a valid Handshake IRQ */
        if ((irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_HANDSHAKE) || (irq_status.followup_payload_len != 0u))
        {
            STM32WLxx_LOG_ERROR("STM32WLxx SPI Handshaking failed. STM32WLxx IRQ does not indicate the desired Handshake status. IRQ flags: 0x%x", irq_status.irq_flags);
            err = RADIO_ERROR_INVALID_STATE;
            break;
        }
        STM32WLxx_LOG_INFO("Successful SPI handshake with STM32WLxx");

        /* Do the protocol compatibility checks */
        const stm32wlxx_version_info_t * const protocol_version = &irq_status.handshake_details.protocol_version;
        const stm32wlxx_version_info_t * const app_version      = &irq_status.handshake_details.app_version;
        SID_PAL_LOG_INFO("Detected STM32WLxx with application version %u.%u.%u", app_version->major, app_version->minor, app_version->patch);

        if ((protocol_version->major != STM32WLxx_RADIO_COMM_PROTOCOL_MAJOR_VERSION)
          || (protocol_version->minor != STM32WLxx_RADIO_COMM_PROTOCOL_MINOR_VERSION)
          || (protocol_version->patch != STM32WLxx_RADIO_COMM_PROTOCOL_PATCH_VERSION))
        {
            SID_PAL_LOG_ERROR("STM32WLxx implements incompatible SPI protocol version: %u.%u.%u vs %u.%u.%u",
                              protocol_version->major, protocol_version->minor, protocol_version->patch,
                              STM32WLxx_RADIO_COMM_PROTOCOL_MAJOR_VERSION, STM32WLxx_RADIO_COMM_PROTOCOL_MINOR_VERSION, STM32WLxx_RADIO_COMM_PROTOCOL_PATCH_VERSION);
            err = RADIO_ERROR_NOT_SUPPORTED;
            break;
        }

        SID_PAL_LOG_INFO("Reported STM32WLxx SPI protocol version: %u.%u.%u", protocol_version->major, protocol_version->minor, protocol_version->patch);

        /* Handshake succeeded */
        STM32WLxx_LOG_DEBUG("Handshake procedure succeeded");
        err = RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void radio_stm32wlxx_pack_settings(const sid_pal_radio_fsk_phy_settings_t * const fsk_phy_cfg,
                                                                           const sid_pal_radio_lora_phy_settings_t * const lora_phy_cfg,
                                                                           stm32wlxx_radio_phy_cfg_t * const out_cfg)
{
    /*---------------------------------- FSK -------------------------------------*/
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.freq ,                             fsk_phy_cfg->freq);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.power,                             fsk_phy_cfg->power);
    STM32WLxx_COPY_CFG_ARRAY_PARAM(out_cfg->fsk_cfg.sync_word,                   fsk_phy_cfg->sync_word);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.sync_word_len,                     fsk_phy_cfg->sync_word_len);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.whitening_seed,                    fsk_phy_cfg->whitening_seed);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.tx_timeout,                        fsk_phy_cfg->tx_timeout);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.symbol_timeout,                    fsk_phy_cfg->symbol_timeout);

    /* fsk_modulation_params */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.bit_rate,                      fsk_phy_cfg->fsk_modulation_params.bit_rate);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.freq_dev,                      fsk_phy_cfg->fsk_modulation_params.freq_dev);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.shaping,                       fsk_phy_cfg->fsk_modulation_params.mod_shaping);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.bandwidth,                     fsk_phy_cfg->fsk_modulation_params.bandwidth);

    /* fsk_packet_params */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.preamble_length,               fsk_phy_cfg->fsk_packet_params.preamble_length);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.preamble_min_detect,           fsk_phy_cfg->fsk_packet_params.preamble_min_detect);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.sync_word_length,              fsk_phy_cfg->fsk_packet_params.sync_word_length);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.addr_comp,                     fsk_phy_cfg->fsk_packet_params.addr_comp);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.header_type,                   fsk_phy_cfg->fsk_packet_params.header_type);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.crc_type,                      fsk_phy_cfg->fsk_packet_params.crc_type);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.radio_whitening_mode,          fsk_phy_cfg->fsk_packet_params.radio_whitening_mode);

    /* fsk_cad_params */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_ed_rssi_threshold,             fsk_phy_cfg->fsk_cad_params.fsk_ed_rssi_threshold);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_ed_duration_mus,               fsk_phy_cfg->fsk_cad_params.fsk_ed_duration_mus);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_cs_min_prm_det,                fsk_phy_cfg->fsk_cad_params.fsk_cs_min_prm_det);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_cs_duration_us,                fsk_phy_cfg->fsk_cad_params.fsk_cs_duration_us);

    /* fsk_phy_hdr */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.phy_hdr_fcs_type,                  (stm32wlxx_radio_fsk_fcs_t)fsk_phy_cfg->fsk_phy_hdr.fcs_type);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.phy_hdr_is_data_whitening_enabled, fsk_phy_cfg->fsk_phy_hdr.is_data_whitening_enabled);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.phy_hdr_is_fec_enabled,            fsk_phy_cfg->fsk_phy_hdr.is_fec_enabled);
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
    /*----------------------------------------------------------------------------*/

    /*---------------------------------- LoRa ------------------------------------*/
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.freq,                             lora_phy_cfg->freq);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.power,                            lora_phy_cfg->power);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.sync_word,                        lora_phy_cfg->sync_word);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.symbol_timeout,                   lora_phy_cfg->symbol_timeout);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.tx_timeout,                       lora_phy_cfg->tx_timeout);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.lora_ldr_long_interleaved_enable, lora_phy_cfg->lora_ldr_long_interleaved_enable);

