stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio.c
            /* Configure PA parameters based on the selected PA */
            if (STM32WLxx_PA_CFG_USE_HPA == drv_ctx.pa_cfg.device_sel)
            {
                /* Saturate by upper limit for HPA */
                if (drv_ctx.pa_cfg.target_tx_power > RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.target_tx_power = RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM;
                }

                /* Search for the closest optimized config - configure as per AN5457 */
                if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_HPA_OPTIMIZATION_14_DBM)
                {
                    /* +14dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x02u;
                    drv_ctx.pa_cfg.hp_max        = 0x02u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = drv_ctx.pa_cfg.target_tx_power;
                }
                else if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_HPA_OPTIMIZATION_17_DBM)
                {
                    /* +17dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x02u;
                    drv_ctx.pa_cfg.hp_max        = 0x03u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM - (STM32WLxx_PA_CFG_HPA_OPTIMIZATION_17_DBM - drv_ctx.pa_cfg.target_tx_power);
                }
                else if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_HPA_OPTIMIZATION_20_DBM)
                {
                    /* +20dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x03u;
                    drv_ctx.pa_cfg.hp_max        = 0x05u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM - (STM32WLxx_PA_CFG_HPA_OPTIMIZATION_20_DBM - drv_ctx.pa_cfg.target_tx_power);
                }
                else
                {
                    /* +22dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x04u;
                    drv_ctx.pa_cfg.hp_max        = 0x07u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = drv_ctx.pa_cfg.target_tx_power;
                }

                /* Saturate by lower limit for HPA */
                if (drv_ctx.pa_cfg.tx_power_reg < RADIO_STM32WLxx_HPA_LOWER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.tx_power_reg = RADIO_STM32WLxx_HPA_LOWER_LIMIT_DBM;
                }
            }
            else
            {
                /* Saturate by upper limit for LPA */
                if (drv_ctx.pa_cfg.target_tx_power > RADIO_STM32WLxx_LPA_UPPER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.target_tx_power = RADIO_STM32WLxx_LPA_UPPER_LIMIT_DBM;
                }

                /* Search for the closest optimized config - configure as per AN5457 */
                if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_LPA_OPTIMIZATION_10_DBM)
                {
                    /* +10dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x01u;
                    drv_ctx.pa_cfg.hp_max        = 0x00u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = 13 - (STM32WLxx_PA_CFG_LPA_OPTIMIZATION_10_DBM - drv_ctx.pa_cfg.target_tx_power);
                }
                else if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_LPA_OPTIMIZATION_14_DBM)
                {
                    /* +14dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x04u;
                    drv_ctx.pa_cfg.hp_max        = 0x00u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = drv_ctx.pa_cfg.target_tx_power;
                }
                else
                {
                    /* +15dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x07u;
                    drv_ctx.pa_cfg.hp_max        = 0x00u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = STM32WLxx_PA_CFG_LPA_OPTIMIZATION_14_DBM - (RADIO_STM32WLxx_LPA_UPPER_LIMIT_DBM - drv_ctx.pa_cfg.target_tx_power);
                }

                /* Saturate by lower limit for HPA */
                if (drv_ctx.pa_cfg.tx_power_reg < RADIO_STM32WLxx_LPA_LOWER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.tx_power_reg = RADIO_STM32WLxx_LPA_LOWER_LIMIT_DBM;
                }
            }
        }

        /* Check if the callback specified the ramp up time */
        if (STM32WLxx_PA_CFG_PARAM_INVALID == drv_ctx.pa_cfg.ramp_time)
        {
            /* Use the default value */
            drv_ctx.pa_cfg.ramp_time = RADIO_STM32WLxx_RAMP_40_US;
        }
    }

    return RADIO_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void radio_stm32wlxx_error_manager(const int32_t reported_err, const uint32_t set_radio_sleep)
{
    if (reported_err != RADIO_ERROR_NONE)
    {
        /* A new error was reported - increment error counter and update the timestamp */
        drv_ctx.error_monitor.drv_err_cntr += STM32WLxx_RADIO_ERROR_ASYM_INC_FACTOR; /* Make the error counter increment faster than decrement to address interleaved errors (e.g. error - no error - error - no error, etc.) */
        (void)sid_pal_uptime_now(&drv_ctx.error_monitor.last_err_timestamp);
    }
    else
    {
        /* Operation completed successfully - decrement the error counter */
        if (drv_ctx.error_monitor.drv_err_cntr > 0u)
        {
            drv_ctx.error_monitor.drv_err_cntr--;
        }
    }

    /* Check if we are above the error threshold and react if needed */
    if (drv_ctx.error_monitor.drv_err_cntr > (STM32WLxx_RADIO_ERROR_LIMIT * STM32WLxx_RADIO_ERROR_ASYM_INC_FACTOR))
    {
        int32_t                err;
        stm32wlxx_hal_status_t hal_err;

        SID_PAL_LOG_WARNING("Too many radio errors in a row. Resetting the radio...");

        drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;

        do
        {
            /* Ensure STM32WLxx won't trigger any interrupt if we are re-initializing ----*/
            hal_err = stm32wlxx_hal_disarm_irq(&drv_ctx);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                /* Logs are provided by the stm32wlxx_hal_disarm_irq() */
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }
            __COMPILER_BARRIER(); /* Ensure IRQ is disarmed right now before any further actions take place */
            /*----------------------------------------------------------------------------*/

            /* Bring down the underlying hardware */
            err = radio_stm32wlxx_platform_deinit();
            if (err != RADIO_ERROR_NONE)
            {
                STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_deinit() failed. Error %d", err);
                break;
            }

            /* Initialize the underlying hardware */
            err = radio_stm32wlxx_platform_init();
            if (err != RADIO_ERROR_NONE)
            {
                STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_init() failed with error %d", err);
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }

            /* Invalidate radio state since the WL side may be in LPM mode */
            drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;

