stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio.c
            /* Perform multiple attempts of handshaking with the STM32WLxx ---------------*/
            uint32_t handshake_attempts_counter = 0u;
            do
            {
                handshake_attempts_counter++;

                err = radio_stm32wlxx_do_handshake();
                if ((RADIO_ERROR_NONE == err) || (RADIO_ERROR_NOT_SUPPORTED == err))
                {
                    /* Exit either on success or unrecoverable error */
                    break;
                }
            } while (handshake_attempts_counter < STM32WLxx_HANDSHAKE_ATTEMPTS_LIMIT);

            /* Check if Handshake procedure succeeded */
            if (err != RADIO_ERROR_NONE)
            {
                STM32WLxx_LOG_ERROR("radio_stm32wlxx_do_handshake() failed with error %d", err);
                break;
            }
            /*----------------------------------------------------------------------------*/

            /* Now configure STM32WLxx IRQ line in as a regular IRQ line -----------------*/
            hal_err = stm32wlxx_hal_arm_irq(&drv_ctx);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                /* Logs are provided by the stm32wlxx_hal_arm_irq() */
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }
            /*----------------------------------------------------------------------------*/

            /* Ensure STM32WLxx's SubGHz radio is in Standby -----------------------------*/
            hal_err = stm32wlxx_hal_radio_standby(&drv_ctx); /* Don't use sid_pal_radio_standby() to avoid recursive calls */
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_LOG_ERROR("Failed to put SubGHz to StandBy. HAL error %u", (uint32_t)hal_err);
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }

            drv_ctx.radio_state = SID_PAL_RADIO_STANDBY;
            /*----------------------------------------------------------------------------*/

            /* Send out SubGHz radio configuration via SPI to STM32WLxx ------------------*/
            err = stm32wlxx_radio_send_subghz_config(FALSE);
            if (err != RADIO_ERROR_NONE)
            {
                /* Logs are provided by stm32wlxx_radio_send_subghz_config() */
                SID_PAL_LOG_ERROR("Failed to re-send SubGHz HW config. Error %d", err);
                break;
            }

            /* Perform the final STM32WLxx Sidewalk Radio App initialization steps */
            hal_err = stm32wlxx_hal_apply_base_hw_config(&drv_ctx, FALSE);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to apply essential SubGHz HW config. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* Explicitly set modem mode on the remote side */
            hal_err = stm32wlxx_hal_radio_set_modem_mode(&drv_ctx, drv_ctx.modem);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to set SubGHz modem mode. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* Restore the selected radio frequency */
            hal_err = stm32wlxx_hal_radio_set_frequency(&drv_ctx, drv_ctx.radio_freq_hz);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to set SubGHz frequency. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* Put the radio into Sleep mode if requested */
            if (set_radio_sleep != FALSE)
            {
                hal_err = stm32wlxx_hal_radio_sleep(&drv_ctx, 0u, FALSE); /* Don't use sid_pal_radio_sleep() to avoid recursive calls */
                if (hal_err != STM32WLxx_HAL_STATUS_OK)
                {
                    /* This is not a fatal error. The radio is in Standby already, software may proceed even if the radio failed to enter Sleep back for some reason. There's only power consumption penalty here */
                    SID_PAL_LOG_ERROR("Failed to put STM32WLxx back to sleep. Error code %u", (uint32_t)hal_err);
                    err = RADIO_ERROR_IO_ERROR;
                    drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;
                    break;
                }

                /* The radio is back in Sleep now */
                drv_ctx.radio_state = SID_PAL_RADIO_SLEEP;
            }
            else
            {
                /* The radio is in Standby now as a result of the handshake procedure */
            }

            /* Radio re-initialized successfully */
            err = RADIO_ERROR_NONE;
            drv_ctx.error_monitor.drv_err_cntr = 0u;
            SID_PAL_LOG_INFO("Radio re-initialized");
        } while (0);

        if (err != RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to re-initialize STM32WLxx radio. This may indicate a permanent failure");
        }
    }
}

/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static void _user_data_transfer_thread(void * context)
{
    sid_error_t sid_err;
    osStatus_t os_err;

    (void)context;

    do
    {
        SID_PAL_ASSERT(drv_ctx.udt_ctx.outbound_msg_queue != NULL);

        /* Ensure the radio is fully initialized before any further actions */
        while (FALSE == drv_ctx.init_done)
        {
            /* Wait for driver initialization */
            sid_pal_scheduler_delay_ms(10u);
        }

        /* Wait for any user app requests to send out data to the STM32WLxx side */
        stm32wlxx_ext_ifc_out_msg_desc_t msg_desc;
        os_err = osMessageQueueGet(drv_ctx.udt_ctx.outbound_msg_queue, &msg_desc, NULL, osWaitForever);

        if (osOK == os_err)
        {
            if ((msg_desc.data_ptr != NULL) && (msg_desc.data_len > 0u))
            {
                stm32wlxx_hal_status_t hal_err;
                struct sid_timespec t_now;

                /* Calculate available time for UDT */
                sid_err = sid_pal_uptime_now(&t_now);
                if (sid_err != SID_ERROR_NONE)
                {
                    SID_PAL_LOG_ERROR("Unable to determine current time. UDT skipped")
                    break;
                }

