stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio.c
                if ((sid_time_is_infinity(&drv_ctx.udt_ctx.cut_off_time) == FALSE)
                  && (sid_time_gt(&t_now, &drv_ctx.udt_ctx.cut_off_time) != FALSE))
                {
                    /* No time left for UDT */
                    drv_ctx.udt_ctx.udt_enabled = FALSE;
                }

                /* Wait until UDT is allowed */
                while (FALSE == drv_ctx.udt_ctx.udt_enabled)
                {
                    sid_pal_scheduler_delay_ms(1u);
                }

                /* Send out user data. Use critical section to guarantee atomic data transfer (e.g. avoid interruption mid-flight by sid_pal_radio_standby() ) */
                sid_pal_enter_critical_region();
                hal_err = stm32wlxx_hal_send_user_data(&drv_ctx, msg_desc.data_ptr, msg_desc.data_len);
                sid_pal_exit_critical_region();
                if (hal_err != STM32WLxx_HAL_STATUS_OK)
                {
                    SID_PAL_LOG_ERROR("UDT failed to send out %u bytes. HAL error %u", msg_desc.data_len, (uint32_t)hal_err);
                }
                else
                {
                    SID_PAL_LOG_DEBUG("UDT sent %u bytes", msg_desc.data_len);
                }

                /* Automatically free the buffer after processing is done (if requested) */
                if (msg_desc.auto_free != FALSE)
                {
                    free(msg_desc.data_ptr);
                }
            }
            else
            {
                SID_PAL_LOG_WARNING("UDT transfer skipped - empty data provided");
            }
        }
        else
        {
            /* Some unexpected CMSIS/OS error occurred */
            SID_PAL_LOG_ERROR("Unexpected error while accessing UDT queue. OS error 0x%08x", (uint32_t)os_err);
        }
    } while (TRUE);

    /* Terminate the thread properly if the code ever gets here */
    SID_PAL_LOG_WARNING("UDT thread terminated");
    osThreadExit();
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t stm32wlxx_radio_send_subghz_config(const uint32_t need_ack)
{
    uint32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    do
    {
        /* Collect the settings */
        const sid_pal_radio_fsk_phy_settings_t * const fsk_phy_settings =
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
                                                                            rnet_get_fsk_phy_settings();
#else
                                                                            NULL;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

        const sid_pal_radio_lora_phy_settings_t * const lora_phy_settings =
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
                                                                            rnet_get_lora_phy_settings();
#else
                                                                            NULL;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

        stm32wlxx_radio_phy_cfg_t subghz_cfg;

        radio_stm32wlxx_pack_settings(fsk_phy_settings, lora_phy_settings, &subghz_cfg);

        /* Send out the settings and wait for them to be applied */
        hal_err = stm32wlxx_hal_send_subghz_config(&drv_ctx, &subghz_cfg, need_ack);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Unable to send out config to STM32WLxx. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_IO_ERROR;
            break;
        }

        /* Save the applied Phy settings as sent to the STM32WLxx */
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
        SID_STM32_UTIL_fast_memcpy(&drv_ctx.applied_fsk_phy_cfg,  fsk_phy_settings,  sizeof(drv_ctx.applied_fsk_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        SID_STM32_UTIL_fast_memcpy(&drv_ctx.applied_lora_phy_cfg, lora_phy_settings, sizeof(drv_ctx.applied_lora_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

        err = RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED const halo_drv_stm32wlxx_ctx_t* stm32wlxx_radio_get_drv_ctx_ctx(void)
{
    return &drv_ctx;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void stm32wlxx_app_radio_set_device_config(const stm32wlxx_app_radio_device_config_t * const cfg)
{
    /* Validate the config */
    if ((false == cfg->enable_lpa) && (false == cfg->enable_hpa))
    {
        SID_PAL_LOG_ERROR("Invalid radio config - both LPA and HPA are disabled. At least one PA shall be enabled");
        SID_PAL_ASSERT(0);
    }

    /* Store the config */
    drv_ctx.config = cfg;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint8_t sid_pal_radio_get_status(void)
{
    return drv_ctx.radio_state;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_pal_radio_modem_mode_t sid_pal_radio_get_modem_mode(void)
{
    sid_pal_radio_modem_mode_t mode;

    switch (drv_ctx.modem)
    {
        case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK:
            mode = SID_PAL_RADIO_MODEM_MODE_FSK;
            break;

        case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA:
            mode = SID_PAL_RADIO_MODEM_MODE_LORA;
            break;

        case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED:
        default:
            SID_PAL_LOG_ERROR("sid_pal_radio_get_modem_mode() called with modem in undefined state");
            mode = SID_PAL_RADIO_MODEM_MODE_LORA; /* Default to LoRa for compatibility with previous implementations */
            break;
    }

    return mode;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_modem_mode(sid_pal_radio_modem_mode_t mode)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_set_modem_mode...");

    /* Skip the switch if we are already in the requested modem mode */
    if ((sid_pal_radio_get_modem_mode() == mode) && (drv_ctx.modem != STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED))
    {
        STM32WLxx_LOG_DEBUG("Set Modem Mode skipped - already in requested mode");
        err = RADIO_ERROR_NONE;
        return err;
    }

    /* Send out modem mode switch request */
    switch (mode)
    {
        case SID_PAL_RADIO_MODEM_MODE_FSK:
            hal_err = stm32wlxx_hal_radio_set_modem_mode(&drv_ctx, STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK);
            if (STM32WLxx_HAL_STATUS_OK == hal_err)
            {
                drv_ctx.modem = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK;
                drv_ctx.subghz_irq_mask = STM32WLxx_RADIO_COMM_DEFAULT_FSK_IRQ_MASK;
                err = RADIO_ERROR_NONE;
            }
            else
            {
                STM32WLxx_LOG_ERROR("sid_pal_radio_set_modem_mode failed to set FSK mode. HAL error %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
            }
            break;

