stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio.c
    /* Restore the app IRQ mask */
    drv_ctx.app_irq_mask = app_irq_mask;

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_tx_payload(const uint8_t *buffer, uint8_t size)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_set_tx_payload");
    do
    {
        if ((NULL == buffer) || (0u == size))
        {
            err = RADIO_ERROR_INVALID_PARAMS;
            break;
        }

        hal_err = stm32wlxx_hal_set_subghz_tx_buf(&drv_ctx, buffer, size);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_IO_ERROR;
            break;
        }

        STM32WLxx_LOG_DEBUG("set_tx_payload %u", size);
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set SubGHz radio Tx payload. Error %u", (uint32_t)err);
    }

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_start_tx(uint32_t timeout)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_start_tx... timeout: %d", timeout);

    do
    {
        hal_err = stm32wlxx_hal_radio_start_tx(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to start Tx via STM32WLxx. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        drv_ctx.radio_state = SID_PAL_RADIO_TX;

#if (CFG_LPM_LEVEL != 0)
        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == drv_ctx.modem)
        {
            /* Prohibit Stop mode until Tx is done as we need fast response on Tx Done IRQ */
            UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
            UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
        }
        else
        {
            /* For LoRa link we don't need such rapid response. Additional 200-250us added by the wakeup from Stop LPM won't affect the link performance and we can save some power */
        }
#endif /* (CFG_LPM_LEVEL != 0) */

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LED after the actual start of Tx to avoid impact on timings */
        stm32wlxx_radio_hal_tx_led_on(&drv_ctx);
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_tx_continuous_wave(uint32_t freq, int8_t power)
{
#if HALO_ENABLE_DIAGNOSTICS
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_INFO("sid_pal_radio_set_tx_continuous_wave... ");

    do
    {
        /* sid_pal_radio_set_tx_power() since adjusting Tx power requires update of all the related PA settings */
        err = sid_pal_radio_set_tx_power(power);
        if (err != RADIO_ERROR_NONE)
        {
            /* Logs are provided by sid_pal_radio_set_tx_power() */
            break;
        }

        hal_err = stm32wlxx_hal_start_continuous_wave_tx(&drv_ctx, freq);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to start STM32WLxx SubGHz CW Tx. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        drv_ctx.radio_state = SID_PAL_RADIO_TX;

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LED after the actual start of Tx to avoid impact on timings */
        stm32wlxx_radio_hal_tx_led_on(&drv_ctx);
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

    return err;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_start_rx(uint32_t timeout)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    do
    {
        hal_err = stm32wlxx_hal_radio_start_rx(&drv_ctx, timeout);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to start STM32WLxx SubGHz Rx. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        drv_ctx.radio_state = SID_PAL_RADIO_RX;

#if (CFG_LPM_LEVEL != 0)
        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == drv_ctx.modem)
        {
            /* Prohibit Stop mode until Rx is done as we need fast response on Rx Done IRQ  */
            UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
            UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
        }
        else
        {
            /* For LoRa link we don't need such rapid response. Additional 200-250us added by the wakeup from Stop LPM won't affect the link performance and we can save some power */
        }
#endif /* (CFG_LPM_LEVEL != 0) */

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LED after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_is_cad_exit_mode(sid_pal_radio_cad_param_exit_mode_t exit_mode)
{
    int32_t err;

