stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_random(uint32_t *random)
{
    SID_PAL_LOG_ERROR("sid_pal_radio_random() is not implemented");
    return RADIO_ERROR_NOT_SUPPORTED;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int16_t sid_pal_radio_get_ant_dbi(void)
{
    SID_PAL_ASSERT(drv_ctx.regional_radio_param != NULL);
    return drv_ctx.regional_radio_param->ant_dbi;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_get_cca_level_adjust(sid_pal_radio_data_rate_t data_rate, int8_t *adj_level)
{
    int32_t err;

    SID_PAL_ASSERT(drv_ctx.regional_radio_param != NULL);

    if ((data_rate <= SID_PAL_RADIO_DATA_RATE_INVALID) || (data_rate > SID_PAL_RADIO_DATA_RATE_MAX_NUM))
    {
        err = RADIO_ERROR_INVALID_PARAMS;
    }
    else
    {
        *adj_level = drv_ctx.regional_radio_param->cca_level_adjust[data_rate - 1];
        err = RADIO_ERROR_NONE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_get_chan_noise(uint32_t freq, int16_t *noise)
{
#if HALO_ENABLE_DIAGNOSTICS
    //TODO: implement
    return RADIO_ERROR_NOT_SUPPORTED;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_get_radio_state_transition_delays(sid_pal_radio_state_transition_timings_t * state_delay)
{
    static_assert(sizeof(*state_delay) == sizeof(drv_ctx.config->state_timings));
    SID_STM32_UTIL_fast_memcpy(state_delay, &drv_ctx.config->state_timings, sizeof(*state_delay));
    return RADIO_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_init(sid_pal_radio_event_notify_t notify, sid_pal_radio_irq_handler_t dio_irq_handler, sid_pal_radio_rx_packet_t *rx_packet)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;
    int8_t tx_power;

    SID_PAL_LOG_DEBUG("sid_pal_radio_init... ");
    do
    {
        /* Validate the inputs -------------------------------------------------------*/
        if ((NULL == notify) || (NULL == dio_irq_handler) || (NULL == rx_packet))
        {
            STM32WLxx_LOG_ERROR("sid_pal_radio_init() aborted due to invalid input parameters");
            err = RADIO_ERROR_INVALID_PARAMS;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Check if the driver is initialized already */
        if (drv_ctx.init_done != FALSE)
        {
            SID_PAL_LOG_WARNING("STM32WLxx driver is initialized already. Requesting deinitialization");

            /* Deinitialize any hardware that may have been partially initialized to bring it to the known state */
            err = sid_pal_radio_deinit();
            if (err != RADIO_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("Unable to initialize STM32WLxx radio - driver is initialized already and deinitialization failed. Error %d", err);
                break;
            }
        }
        /*----------------------------------------------------------------------------*/

        /* Ensure STM32WLxx won't trigger any interrupt if we are re-initializing ----*/
        hal_err = stm32wlxx_hal_disarm_irq(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            /* Logs are provided by the stm32wlxx_hal_disarm_irq() */
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }
        __COMPILER_BARRIER(); /* Ensure IRQ is disarmed right now before any further actions take place */
        /*----------------------------------------------------------------------------*/

        /* Initialize variables, statuses, etc. --------------------------------------*/
        /* Create a binary semaphore to wait for Request Completed IRQ when required */
        SID_PAL_ASSERT(NULL == drv_ctx.req_completed_wait_lock);
        drv_ctx.req_completed_wait_lock = osSemaphoreNew(1u, 1u, &wlxx_request_ack_lock_attributes);

        /* Check iof the semaphore was actually created */
        if (NULL == drv_ctx.req_completed_wait_lock)
        {
            SID_PAL_LOG_ERROR("Failed to create semaphore for Request Processed IRQ handling");
            err = RADIO_ERROR_NOMEM;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Create a binary semaphore to wait for a generic IRQ indication when required */
        SID_PAL_ASSERT(NULL == drv_ctx.irq_detected_wait_lock);
        drv_ctx.irq_detected_wait_lock = osSemaphoreNew(1u, 0u, &wlxx_irq_wait_lock_attributes);

        /* Check iof the semaphore was actually created */
        if (NULL == drv_ctx.irq_detected_wait_lock)
        {
            SID_PAL_LOG_ERROR("Failed to create semaphore for IRQ detection handling");
            err = RADIO_ERROR_NOMEM;
            break;
        }
        /*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        /* Initialize User Data Transfer service -------------------------------------*/
        /* Create UDT message queue */
        if (NULL == drv_ctx.udt_ctx.outbound_msg_queue)
        {
            drv_ctx.udt_ctx.outbound_msg_queue = osMessageQueueNew(STM32WLxx_UDT_OUT_MSG_QUEUE_LEN, sizeof(stm32wlxx_ext_ifc_out_msg_desc_t), NULL);
            if (NULL == drv_ctx.udt_ctx.outbound_msg_queue)
            {
                SID_PAL_LOG_ERROR("Can't create UDT message queue. No memory");
                err = RADIO_ERROR_NOMEM;
                break;
            }
        }

        /* Create the task that will handle the UDT */
        if (NULL == drv_ctx.udt_ctx.task)
        {
            drv_ctx.udt_ctx.task = osThreadNew(_user_data_transfer_thread, NULL, &wlxx_user_data_transfer_thread_attributes);
            if (NULL == drv_ctx.udt_ctx.task)
            {
                SID_PAL_LOG_ERROR("Can't create UDT processing thread. No memory");
                err = RADIO_ERROR_NOMEM;
                break;
            }
        }
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        /* Configure driver context with the supplied parameters */
        drv_ctx.radio_rx_packet      = rx_packet;
        drv_ctx.report_radio_event   = notify;
        drv_ctx.irq_handler          = dio_irq_handler;

#if ((SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 != 0) && (SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 == 0))
        /* FSK-only SubGHz link, default to FSK modem mode for initialization */
        drv_ctx.modem                = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK;
        drv_ctx.subghz_irq_mask      = STM32WLxx_RADIO_COMM_DEFAULT_FSK_IRQ_MASK;
#else
        /* LoRa-only or FSK-LoRa SubGHz link - default to LoRa modem mode for initialization */
        drv_ctx.modem                = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA;
        drv_ctx.subghz_irq_mask      = STM32WLxx_RADIO_COMM_DEFAULT_LORA_IRQ_MASK;
#endif

