stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio.c
        /* Store the selected region the in driver context. It won't be sent to the STM32WLxx immediately */
        err = sid_pal_radio_set_region(drv_ctx.config->regional_config.radio_region);
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("sid_pal_radio_set_region() failed with error %d", err);
            break;
        }

        /* At this point the SubGHz radio and the entire STM32WLxx MCU may be in any state (e.g. in LPM Sleep or Stop) */
        drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;
        /*----------------------------------------------------------------------------*/

        /* Initialize the underlying hardware ----------------------------------------*/
        err = radio_stm32wlxx_platform_init();
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_init() failed with error %d", err);
            break;
        }

        /* Perform multiple attempts of handshaking with the STM32WLxx ---------------*/
        uint32_t handshake_attempts_counter = 0u;
        do
        {
            handshake_attempts_counter++;

            err = radio_stm32wlxx_do_handshake();
            if ((RADIO_ERROR_NONE == err) || (RADIO_ERROR_NOT_SUPPORTED == err))
            {
                /* Exit either on success or unrecoverable error */
                break;
            }
        } while (handshake_attempts_counter < STM32WLxx_HANDSHAKE_ATTEMPTS_LIMIT);

        /* Check if Handshake procedure succeeded */
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_do_handshake() failed with error %d", err);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Now configure STM32WLxx IRQ line in as a regular IRQ line -----------------*/
        hal_err = stm32wlxx_hal_arm_irq(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            /* Logs are provided by the stm32wlxx_hal_arm_irq() */
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Enable STM32WLxx Sidewalk Radio App-level IRQs */
        drv_ctx.app_irq_mask = STM32WLxx_ALL_APP_IRQ_MASK;
        /*----------------------------------------------------------------------------*/

        /* Ensure STM32WLxx's SubGHz radio is in Standby -----------------------------*/
        err = sid_pal_radio_standby();
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("sid_pal_radio_standby() failed with error %d", err);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Setup power amplifier config values - not sent immediately ----------------*/
        err = sid_pal_radio_get_max_tx_power(SID_PAL_RADIO_DATA_RATE_50KBPS, &tx_power);
        if (err != RADIO_ERROR_NONE)
        {
        	STM32WLxx_LOG_ERROR("sid_pal_radio_get_max_tx_power() failed with error code %d", err);
            break;
        }
        err = radio_stm32wlxx_set_tx_power_config(tx_power);
        if (err != RADIO_ERROR_NONE)
        {
        	STM32WLxx_LOG_ERROR("radio_stm32wlxx_set_tx_power_config() failed with error code %d", err);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Send out SubGHz radio configuration via SPI to STM32WLxx ------------------*/
        err = stm32wlxx_radio_send_subghz_config(TRUE);
        if (err != RADIO_ERROR_NONE)
        {
            /* Logs are provided by stm32wlxx_radio_send_subghz_config() */
            break;
        }

        /* Perform the final STM32WLxx Sidewalk Radio App initalization steps */
        hal_err = stm32wlxx_hal_apply_base_hw_config(&drv_ctx, TRUE);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to apply essential SubGHz HW config. Error code %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* STM32WLxx puts SubGHz radio back to Standby mode after HW init */

        /* Explicitly set modem mode on the remote side */
        hal_err = stm32wlxx_hal_radio_set_modem_mode(&drv_ctx, drv_ctx.modem);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to set SubGHz modem mode. Error code %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Initialization sequence is finished with no issues */
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Unable to initialize STM32WLxx radio. Error %d", err);

        /* Ensure we deinitialize any hardware that may have been partially initialized */
        (void)sid_pal_radio_deinit();
    }
    else
    {
        drv_ctx.init_done = TRUE;
        SID_PAL_LOG_INFO("STM32WLxx radio initialized");
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_deinit(void)
{
    int32_t err = RADIO_ERROR_GENERIC;
    osStatus_t os_err;

    SID_PAL_LOG_DEBUG("sid_pal_radio_deinit... ");

    do
    {
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        drv_ctx.udt_ctx.udt_enabled = FALSE;
        __COMPILER_BARRIER();
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        /* Bring down the underlying hardware */
        err = radio_stm32wlxx_platform_deinit();
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_deinit() failed. Error %d", err);
            break;
        }

        /* From here radio IRQs won't be processed */

        /* Delete the Request Completed lock */
        os_err = osSemaphoreDelete(drv_ctx.req_completed_wait_lock);
        SID_PAL_ASSERT(osOK == os_err); /* osSemaphoreDelete() can fail only on systematic issues, so assertion is better and more efficient here */
        drv_ctx.req_completed_wait_lock = NULL;

        /* Delete the IRQ Detection lock */
        os_err = osSemaphoreDelete(drv_ctx.irq_detected_wait_lock);
        SID_PAL_ASSERT(osOK == os_err); /* osSemaphoreDelete() can fail only on systematic issues, so assertion is better and more efficient here */
        drv_ctx.irq_detected_wait_lock = NULL;

        /* Invalidate the context */
        drv_ctx.init_done            = FALSE;
        drv_ctx.irq_enabled          = FALSE;
        drv_ctx.app_irq_mask         = STM32WLxx_APP_IRQ_NONE;
        drv_ctx.subghz_irq_mask      = STM32WLxx_SUBGHZ_IRQ_NONE;
        drv_ctx.req_with_ack_ongoing = FALSE;
        drv_ctx.modem                = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED;
        drv_ctx.radio_rx_packet      = NULL;
        drv_ctx.radio_freq_hz        = 0u;
        drv_ctx.radio_state          = SID_PAL_RADIO_UNKNOWN;
        SID_STM32_UTIL_fast_memset(&drv_ctx.last_irq_status,      0u, sizeof(drv_ctx.last_irq_status));
        SID_STM32_UTIL_fast_memset(&drv_ctx.error_monitor,        0u, sizeof(drv_ctx.error_monitor));

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
        drv_ctx.ldt_ongoing          = FALSE;
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
        SID_STM32_UTIL_fast_memset(&drv_ctx.applied_fsk_phy_cfg,  0u, sizeof(drv_ctx.applied_fsk_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        SID_STM32_UTIL_fast_memset(&drv_ctx.applied_lora_phy_cfg, 0u, sizeof(drv_ctx.applied_lora_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Unable to deinitialize STM32WLxx radio. Error %d", err);
    }
    else
    {
        SID_PAL_LOG_INFO("STM32WLxx radio deinitialized");
    }

#if (CFG_LPM_LEVEL != 0)
    /* Allow Stop mode after the radio driver is deinitialized */
    UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
    UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
#endif /* (CFG_LPM_LEVEL != 0) */

    return err;
}

/*----------------------------------------------------------------------------*/

#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
SID_STM32_SPEED_OPTIMIZED void sid_pal_radio_rxtx_start_cb(void)
{
    /* Keep this function as short as possible to minimize its contribution to the Rx/Tx processing delays */
    SIDEWALK_RF_TIMINGS_RXTX_START_GPIO_Port->BSRR = SIDEWALK_RF_TIMINGS_RXTX_START_Pin;
}
#endif /* SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT */
